<template>
  <div class="automatization-page">
    <h1>АВТОМАТИЗАЦІЯ ТА ДИСПЕТЧЕРИЗАЦІЯ</h1>
    <div class="design-topic different-topics">
      <div class="topic-header">
        <div class="topic-numeration">1</div>
        <h2>Проєктування</h2>
      </div>
      <p><img src="../assets/automatization/proekt.jpg" alt="Проєктування">
        Монтаж і налагодження складних систем автоматики на сьогоднішній день немислима без підготовки відповідної
        проєктної документації.
        <br>
        <br>
        Одним із структурних підрозділів ТОВ «СпецКомплекс» є проєктний відділ, оснащений сучасною комп'ютерною
        технікою, здатний в найкоротші терміни розробити на високому професійному рівні, з дотриманням вимог
        нормативних документів, проектну документацію будь-якої складності по розділах:
        автоматизація, електропостачання та диспетчеризація інженерних систем будівель
        (системи опалення, вентиляції та кондиціонування, тепло- холодопостачання; диспетчерський контроль стану
        обладнання електрощитових, ліфтів, сигналів від систем пожежної сигналізації та контролю загазованості).
        <br>
        <br>
        Розробка проєкту по автоматизації і диспетчеризації в загальному випадку складається з наступних
        основних етапів:</p>
      <ul>
        <li>&mdash; Розробка та узгодження технічних вимог по автоматизації та диспетчеризації;</li>
        <li>&mdash; Обстеження об'єкта автоматизації та диспетчеризації;</li>
        <li>&mdash; Вибір засобів автоматизації та диспетчеризації, узгодження основних технічних рішень;</li>
        <li>&mdash; Розробка, погодження та затвердження технічного завдання на проєктування;</li>
        <li>&mdash; Розробка розділів проєктної документації;</li>
        <li>&mdash; Розробка проєктно-кошторисної документації;</li>
        <li>&mdash; Виконання виконавчої документації після проведення монтажних робіт.</li>
      </ul>
      <p>Відповідно до наведеного вище переліку, фахівці нашого проєктного відділу нададуть Вам повний спектр
        послуг пов'язаний з розробкою проєктної документації, заснований на багатому досвіді,
        накопиченому при проєктуванні автоматизації та диспетчеризації інженерних систем таких об'єктів
        як торгово-офісні центри, виробничі бази, логістичні комплекси, аеропорти.
        Детальну інформацію про послуги проєктування Ви можете дізнатися у наших менеджерів</p>
    </div>
    <div class="montage-topic different-topics">
      <div class="topic-header">
        <div class="topic-numeration">2</div>
        <h2>Монтаж та налагодження</h2>
      </div>
      <p>Монтаж та налагодження сучасної системи автоматизації досить відповідальний процес, тому рекомендуємо
        довірити його фірмі, яка володіє достатнім досвідом, кваліфікацією і необхідною базою. Монтажні і
        пуско-налагоджувальні роботи - один з найбільш тривалих і складних з організаційної точки зору етапів
        реалізації проєктів по автоматизації і диспетчеризації. Початком цього етапу, в загальному випадку,
        є твердження замовником прийнятого проєктного рішення.
        <br>
        <br>
        Монтажна дільниця і ділянку наладки ТОВ «СпецКомплекс» складаються з кваліфікованих співробітників
        володіють достатнім досвідом робіт і всім необхідним інструментом, що дозволяє виконувати монтаж та
        налагодження в стислі терміни тим самим економити гроші замовника. Монтаж та налагодження устаткування,
        здача об'єктів в експлуатацію виробляються в строгій відповідності з діючими нормами, стандартами і процедурами,
        рекомендованими виробниками обладнання, з використанням сучасної контрольно-вимірювальної бази.
        <br>
        <br>
        Після закінчення монтажних та пуско-налагоджувальних робіт випускається комплект виконавчої документації.
        Виконавча документація включає в себе результати тестування, протоколи випробувань, комплект креслень з
        внесеними змінами, які відображають всі відхилення від проекту, що виникли під час виконання монтажних робіт.</p>
    </div>
    <div class="collecting-shields-topic different-topics">
      <div class="topic-header">
        <div class="topic-numeration">3</div>
        <h2>Збирання щитів автоматики</h2>
      </div>
      <p>Щити автоматики ТОВ «СпецКомплекс» являють собою надійну конструкцію, зібрану згідно з нормативними документами
        і високими стандартами якості. Акуратність збірки і якість використовуваних комплектуючих - пріоритети,
        яких ТОВ «СпецКомплекс» дотримується при виробництві своїх виробів. Щити автоматики комплектуються апаратурою
        провідних європейських виробників, або, в разі, коли замовнику необхідно бюджетне рішення, деякі вузли можуть
        замінюватися, без шкоди для функціональних можливостей, вузлами вітчизняного виробництва.
        <br>
        <br>
        Кожен щит на стадії виробництва, в обов'язковому порядку, проходить вихідний контроль якості і отримує
        відповідний серійний номер. Наші фахівці проводять випробування, як справності роботи апаратури так і
        функціональних можливостей щита автоматики, після чого щит оформляють повним комплектом документації
        (принципові електричні схеми, паспорт, інструкція з експлуатації, гарантійний талон) і передається замовнику.
        <br>
        <br>
        Підтвердженням якості продукції нашої компанії є мала кількість рекламацій, що дозволяє нам давати гарантію на
        свої вироби 1 рік. Більш докладно про щитах автоматики можна прочитати в розділі
        <a href="boardautomatic">«Щити автоматики»</a>.</p>
    </div>
    <div class="dispatching-topic different-topics">
      <div class="topic-header">
        <div class="topic-numeration">4</div>
        <h2>Системи диспетчеризації</h2>
      </div>
      <p><img src="../assets/automatization/disp.jpg" alt="Системи диспетчеризації">
        У наш час на ринку пропонується велика кількість програмних продуктів-SCADA, орієнтованих на створення систем
        диспетчеризації. При і використанні SCADA-систем від різних виробників, виявляєш, що кожна з них має ті чи інші
        недоліки, наприклад:</p>
      <ul>
        <li>&mdash; висока вартість програмного продукту;</li>
        <li>&mdash; недостатня гнучкість для задоволення специфічних побажань замовника (формування звітів, таблиць,
          графіків і ін. В необхідній формі);</li>
        <li>&mdash; додаткова плата за розширення функціоналу SCADA-системи (придбання додаткових модулів);</li>
        <li>&mdash; відсутня можливість інтеграції в систему диспетчеризації деяких пристроїв, що мають свій протокол
          обміну даними (електролічильники, теплолічильники та ін.). Тут знову доводиться купувати додатковий модуль,
          OPC-сервер.</li>
      </ul>
      <p>Отримавши необхідний досвід при роботі з програмними додатками різних виробників, нами був розроблений власний
        програмний продукт: SCADA-система Wheel. Система Wheel реалізована на основі технології Java і тому сумісна з
        великою кількістю апаратних платформ, починаючи від одноплатних комп'ютерів і закінчуючи високопродуктивними
        серверами. Гнучка архітектура Wheel дозволяє створювати системи диспетчеризації (SCADA), що забезпечують
        виконання всіх необхідних функцій:</p>
      <ul>
        <li>&mdash; Обмін даними з зовнішніми пристроями за допомогою стандартних відкритих протоколів зв'язку, таких,
          як MODBUS, SNMP;</li>
        <li>&mdash; Людино-машинний інтерфейс з підтримкою сенсорних екранів;</li>
        <li>&mdash; Віддалений доступ до системи за допомогою WEB-технологій;</li>
        <li>&mdash; Відстеження аварійних ситуацій і повідомлення про них різними способами;</li>
        <li>&mdash; Зберігання історичних даних за будь-який період часу і видача цих даних в необхідному
          користувачеві форматі (графіки, таблиці, звіти).</li>
      </ul>
      <p>На вимогу замовника, за допомогою системи Wheel, можуть бути реалізовані будь-які додаткові функції:
        автоматичне регулювання і обробка логічних операцій; маршрутизація даних між різнорідними мережами;
        збереження даних у зовнішніх базах даних; виконання завдань за розкладом і т.д.
        <br>
        <br>
        Розгортання системи диспетчеризації можливо на платформі Linux, Windows, або на будь-який інший платформі,
        що забезпечує виконання Java-програм. Застосування власного софта разом з виробленими нами контролерами
        і пристроями зв'язку з об'єктом, дає нам перевагу в плані гнучкості та вартості системи диспетчеризації.</p>
    </div>
    <div class="different-topics">
      <h3>Наші сертифікати:</h3>
    </div>
    <div class="automatization-imgs">
      <img src="../assets/automatization/certificate_raut_big.gif" alt="Сертифікат 'Раут-автоматик'">
      <img src="../assets/automatization/certificate_sauter_big.gif" alt="Сертифікат 'SAUTER AG'">
      <img src="../assets/automatization/certificate_moeller_big.gif" alt="Сертифікат 'Моеллер Електрик'">
    </div>
  </div>
</template>

<script>
export default {
  name: "AutomatizationPage"
}
</script>

<style scoped>
.automatization-page {
  text-align: center;
}
.different-topics{
  margin: 0 15%
}
.different-topics p {
  font-style: italic;
  color: #717171;
  font-size: large;
  text-align: justify;
}
li {
  list-style-type: none;
  color: #717171;
  font-style: italic;
  text-align: left;
}
.automatization-imgs {
  display: flex;
  flex-direction: row;
  justify-content: center;
}
.automatization-imgs img {
  width: 35%;
  transition: transform .2s;
}
.automatization-imgs img:hover {
  transform: scale(1.5);
}
.different-topics p img {
  //width: 50%;
  float: left;
  margin-right: 2%;
}
.topic-header {
  display: flex;
  align-items: center;
}
.topic-header h2 {
  text-align: left;
  margin-left: 1%;
}
.topic-numeration {
  border: 0.2rem solid red;
  text-align: center;
  width: 2rem;
  height: 2rem;
  display: flex;
  align-items: center;
  justify-content: center;
  font-weight: bold;
}
a {
  text-decoration: none;
  color: black;
  font-style: normal;
  transition: color .4s ease;
}
a:hover {
  color: red;
}
.different-topics h3 {
  text-align: left;
}
@media only screen and (max-width: 750px) {
  .automatization-imgs {
    flex-direction: column;
    align-items: center;
  }
  .automatization-imgs img {
    width: 75%;
  }
}
</style>