<template>
  <div class="board-automatic-page">
    <h1>ЩИТИ АВТОМАТИКИ</h1>
    <div class="board-automatic-vent different-boards">
      <h3>Щити автоматики вентиляційних систем</h3>
      <p>Стандартні щити випускаються в модифікаціях, призначених для управління приточними установками і
        центральними кондиціонерами, а також установками промислового та комерційного холоду.
        Системи управління, реалізовані в щитах автоматики, можуть управляти:
      </p>
      <ul>
        <li>&mdash; рідинними (в тому числі гліколеві) теплообмінниками і електрокалориферами;</li>
        <li>&mdash; рідинними і фреоновими охолоджувачами;</li>
        <li>&mdash; пластинчастими, роторними і гліколевими рекуператорами;</li>
        <li>&mdash; одно- і багатошвидкісними вентиляторами, а також вентиляторами,
          оснащеними частотними регуляторами швидкості обертання;</li>
        <li>&mdash; заслінками припливного і витяжного повітря, змішувальної камери і ін.</li>
      </ul>
      <p>Щит автоматики комплектується необхідними датчиками температури, вологості в приміщенні або в повітроводі,
        якості повітря і концентрації CO. У комплект поставки також входять діфманометри для контролю засмічення
        фільтрів, для захисту від обмерзання пластинчастого рекуператора, для контролю справності вентиляторів.
        Додатково можна замовити необхідну обв'язку вузла управління водяного теплообмінника,
        яка включає клапани з відповідним Kvs, приводи, насоси. Щити автоматики вентиляційних систем комплектуються
        мікропроцесорними контролерами «Certa», «Carel», «Danfoss», «Regin», «Раут-автоматик»
        (більш детальну інформацію про перерахованих вище приладах можна отримати в розділі присвяченому
        мікропроцесорним контролерам), і виконують такі функції:</p>
      <ul>
        <li>&mdash; Управління припливним і витяжним вентиляторами за допомогою кнопок на лицьовій панелі щита або
          з меню контролера;</li>
        <li>&mdash; Підтримка заданих параметрів повітря (температура, вологість);</li>
        <li>&mdash; Управління заслінками припливного, витяжного повітря і рециркуляції;</li>
        <li>&mdash; Перемикання режимів "Зима / Літо";</li>
        <li>&mdash; Індикація роботи вентиляторів, насосів і виникають аварійних ситуацій за допомогою індикаторних ламп
          на лицьовій панелі;</li>
        <li>&mdash; Попереднє включення насоса і повне відкриття клапана до запуску вентилятора в зимовому режимі
          для достатнього прогріву теплообмінника;</li>
        <li>&mdash; Багаторівнева система захисту від замерзання калорифера, що включає:
          <ul>
            <li>&mdash; управління приводом клапана з поворотною пружиною для закриття повітрозабірного клапана
              при виключенні вентилятора або при зникненні напруги живлення;</li>
            <li>&mdash; керування циркуляційним насосом на вузлі обв'язки, що забезпечує постійний потік води
              через калорифер;</li>
            <li>&mdash; постійний контроль температури зворотної води в калорифері у всіх режимах роботи, в тому числі
              і в режимі стоянки;</li>
            <li>&mdash; постійний контроль температури повітря на виході з калорифера.</li>
          </ul>
        </li>
        <li>&mdash; Блокування харчування електронагрівача при виключенні припливного вентилятора;</li>
        <li>&mdash; Здійснення залишкового знімання тепла з електронагрівача. Після команди на зупинку
          системи вентилятор деякий час працює для якнайшвидшого охолодження електрокалорифера;</li>
        <li>&mdash; Захист від перегріву вентиляторів;</li>
        <li>&mdash; Захист при короткому замиканні або перевантаженні;</li>
        <li>&mdash; Відключення системи вентиляції в разі виникнення пожежі.</li>
      </ul>
    </div>
    <div class="board-automatic-heating-watersupply different-boards">
      <h3>Щити автоматики систем опалення та водопостачання</h3>
      <p>Стандартні щити випускаються в модифікаціях, призначених для управління незалежними або
        залежними системами опалення, двоступінчастими або тупиковими системами ГВС. Системи управління,
        реалізовані в щитах автоматики, можуть управляти:</p>
      <ul>
        <li>&mdash; Циркуляційними насосами;</li>
        <li>&mdash; Регулюючими клапанами з триточковим або аналоговим керуванням;</li>
        <li>&mdash; Засувками і соленоїдними клапанами підживлення;</li>
      </ul>
      <p>
        Щит автоматики комплектується необхідними датчиками температури, тиску і перепаду тисків.
        Додатково можна замовити клапани з відповідним Kvs, приводи, насоси. Щити автоматики систем опалення та
        ГВП комплектуються мікропроцесорними контролерами «Certa», «Carel», «Danfoss», «Regin», «Раут-автоматик»,
        (більш детальну інформацію про перерахованих вище приладах можна отримати в розділі присвяченому
        мікропроцесорним контролерам), і виконують наступні функції:
      </p>
      <ul>
        <li>&mdash; Регулювання температури виходу та повернення теплоносія для систем опалення або підтримання
          температури гарячої води на виході з теплообмінника для систем ГВП шляхом впливу на регулюючий клапан
          з імпульсним або аналоговим керуванням за допомогою адаптивного самоналаштуванням ПІД-регулятора;</li>
        <li>&mdash; Підтримка обраного параметра на заданому значенні або регулювання обраного параметра по
          мережевому графіку розрахунковому (враховується температура зовнішнього повітря) або
          реальному (враховується температура зовнішнього повітря і теплоносія, що подає, теплової мережі);</li>
        <li>&mdash; Режим енергозбереження, зниження уставки регулювання в нічний час і / або святкові та
          вихідні дні, для системи опалення і включення / вимикання циркуляційних насосів через задані проміжки часу
          або зниження температури гарячої води в циркуляційному контурі;</li>
        <li>&mdash; Захист від прикипання клапана (періодичний прогін);</li>
        <li>&mdash; Управління групою з двох насосів з організацією їх поперервної роботи, АВР і захистом від
          «сухого ходу»;</li>
        <li>&mdash; Можливість включення функції автоматичного перезапуску насосів після зникнення сигналу «сухий хід»
          або збою по електроживленню;</li>
      </ul>
    </div>
    <div class="board-automatic-imgs">
      <img src="../assets/production/boardautomatic/boardautomaticimg1.jpg" alt="Щит автоматики №1">
      <img src="../assets/production/boardautomatic/boardautomaticimg2.jpg" alt="Щит автоматики №2">
      <img src="../assets/production/boardautomatic/boardautomaticimg3.jpg" alt="Щит автоматики №3">
    </div>
  </div>
</template>

<script>
export default {
  name: "BoardAutomaticPage"
}
</script>

<style scoped>
.board-automatic-page {
  text-align: center;
}
.different-boards{
  margin: 0 15%
}
.different-boards p {
  font-style: italic;
  color: #717171;
  font-size: large;
  text-align: justify;
}
li {
  list-style-type: none;
  color: #717171;
  font-style: italic;
  text-align: left;
}
.board-automatic-imgs {
  display: flex;
  flex-direction: row;
  justify-content: center;
}
.board-automatic-imgs img {
  width: 35%;
  transition: transform .2s;
}
.board-automatic-imgs img:hover {
  transform: scale(1.5);
}
@media only screen and (max-width: 750px) {
  .board-automatic-imgs {
    flex-direction: column;
    align-items: center;
  }
  .board-automatic-imgs img {
    width: 75%;
  }
}
</style>