<template>
  <div class="electricity-page">
    <h1>ЕЛЕКТРОПОСТАЧАННЯ</h1>
    <div class="different-topics">
      <p>Сучасна система електропостачання являє собою складний комплекс технічних засобів, призначених для забезпечення
        споживачів електричною енергією, який має в своєму складі елементи обліку електроенергії (щит обліку),
        ввідно-розподільний пристрій, що дозволяє забезпечити рівномірний розподіл електроенергії по споживачах і захист
        людей, з'єднувальних ліній, кінцевих пристроїв і споживачів</p>
      <img src="../assets/electricity/pic2.jpg" alt="Рисунок 1">
      <p>В електропостачанні будівель і споруд немає дрібниць, важливий кожен етап: розрахунок, монтаж, випробування.
        Помилки на будь-який з стадій виконання робіт з електропостачання ведуть до незапланованих витрат,
        зниження якості енергії, недостатню надійність мереж і так далі. Велике значення має правильний вибір типу
        кабелів і проводів, що застосовуються для прокладки сполучних ліній, їх перетин. Підсумки неграмотно проведених
        робіт з електропостачання бувають плачевні: в кращому випадку спрацює запобіжник, і електропостачання
        перерветься, в гіршому - це може загрожувати загорянням, виходом з ладу дорогого електроустаткування
        і так далі. Тому не варто економити там, де це може обернутися збитками. Тому рекомендуємо звернутися до послуг
        нашої компанії, яка зарекомендувала себе як надійний постачальник комплексних рішень по електропостачанню.
      </p>
      <img src="../assets/electricity/pic1.jpg" alt="Рисунок 2">
      <p>ТОВ «Спецкомплекс» здійснює повний комплекс робіт з електропостачання, основні з яких це:</p>
      <ul>
        <li>&mdash; розробка проекту системи електропостачання;</li>
        <li>&mdash; узгодження проекту з електропостачання;</li>
        <li>&mdash; поставка обладнання електротехнічного призначення від провідних виробників;</li>
        <li>&mdash; прокладка силового кабелю;</li>
        <li>&mdash; проведення внутрішньомайданчикового електромонтажу;</li>
        <li>&mdash; електромонтаж та ремонт щитових, установка низьковольтної апаратури;</li>
        <li>&mdash; електромонтаж та заміна освітлювального та електроустановочні обладнання;</li>
        <li>&mdash; пусконалагоджувальні та сервісні роботи;</li>
        <li>&mdash; гарантійне і післягарантійне обслуговування.</li>
      </ul>
    </div>
  </div>
</template>

<script>
export default {
  name: "ElectricityPage"
}
</script>

<style scoped>
.electricity-page {
  text-align: center;
}
.different-topics{
  margin: 0 15%
}
.different-topics p {
  font-style: italic;
  color: #717171;
  font-size: large;
  text-align: justify;
}
li {
  list-style-type: none;
  color: #717171;
  font-style: italic;
  text-align: left;
}
</style>